havrak/UAV-project/drone software/Sample Code/STM32/STM32Core IIC reading 1 module/Source/APP/Main.c
/*
Author£ºKevin
Web£ºhttp://RobotControl.taobao.com
Compilation environment£ºMDK-Lite  Version: 5.17
Initial release time: 2016-1-31
Test£º This program has been tested on the STM32Core platform successfully.
Features£º
Use STM32Core platform serial port 2 to read the data of JY901, and then directly connect to the host computer through serial port 1. The baud rate of 9600 is selected on the host computer.
What you see with serial debugging software is a hexadecimal number.
Wiring Connection
USB-TTL serial converter      STM32Core              JY901
VCC          -----           VCC        ----        VCC
TX           -----           RX1     
RX           -----           TX1
GND          -----           GND        ----        GND
                             SDA2       ----        SDA
							 SCL2       ----        SCL
------------------------------------
 */
#include <string.h>
#include <stdio.h>
#include "Main.h"
#include "REG.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"
#include "UART1.h"
#include "delay.h"
#include "IOI2C.h"
#include "hw_config.h"

void ShortToChar(short sData,unsigned char cData[])
{
	cData[0]=sData&0xff;
	cData[1]=sData>>8;
}
short CharToShort(unsigned char cData[])
{
	return ((short)cData[1]<<8)|cData[0];
}

int main(void)
{  
  unsigned char chrTemp[30];
	unsigned char str[100];
	float a[3],w[3],h[3],Angle[3];
		
	USB_Config();		
	SysTick_init(72,10);
	Initial_UART1(115200);
	IIC_Init();
	
	while (1)
	{
		delay_ms(100);
		IICreadBytes(0x50, AX, 24,&chrTemp[0]);
		a[0] = (float)CharToShort(&chrTemp[0])/32768*16;
		a[1] = (float)CharToShort(&chrTemp[2])/32768*16;
		a[2] = (float)CharToShort(&chrTemp[4])/32768*16;
		w[0] = (float)CharToShort(&chrTemp[6])/32768*2000;
		w[1] = (float)CharToShort(&chrTemp[8])/32768*2000;
		w[2] = (float)CharToShort(&chrTemp[10])/32768*2000;
		h[0] = CharToShort(&chrTemp[12]);
		h[1] = CharToShort(&chrTemp[14]);
		h[2] = CharToShort(&chrTemp[16]);
		Angle[0] = (float)CharToShort(&chrTemp[18])/32768*180;
		Angle[1] = (float)CharToShort(&chrTemp[20])/32768*180;
		Angle[2] = (float)CharToShort(&chrTemp[22])/32768*180;
		
		sprintf((char*)str,"0x50:  a:%.3f %.3f %.3f w:%.3f %.3f %.3f  h:%.0f %.0f %.0f  Angle:%.3f %.3f %.3f \r\n",a[0],a[1],a[2],w[0],w[1],w[2],h[0],h[1],h[2],Angle[0],Angle[1],Angle[2]);
		UART1_Put_String(str);		
		USB_TxWrite(str, strlen((char*)str));
	
	
    }
}



